Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 4, 82, 102,  0                                            
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 4, 82, 102, 3 2624        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 4, 82, 102, 3 128         conv3d_16[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 4, 82, 102, 3 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 4, 82, 102, 3 27680       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 82, 102, 3 128         conv3d_17[0][0]                  
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 4, 82, 102, 3 128         input_2[0][0]                    
__________________________________________________________________________________________________
add_5 (Add)                     (None, 4, 82, 102, 3 0           batch_normalization_11[0][0]     
                                                                 conv3d_18[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 82, 102, 3 0           add_5[0][0]                      
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 4, 82, 102, 6 55360       activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 4, 82, 102, 6 256         conv3d_19[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 82, 102, 6 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 4, 82, 102, 6 110656      activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 4, 82, 102, 6 256         conv3d_20[0][0]                  
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 4, 82, 102, 6 2112        activation_11[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 4, 82, 102, 6 0           batch_normalization_13[0][0]     
                                                                 conv3d_21[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 82, 102, 6 0           add_6[0][0]                      
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 2, 41, 51, 12 221312      activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 2, 41, 51, 12 512         conv3d_22[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 2, 41, 51, 12 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 2, 41, 51, 12 442496      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 2, 41, 51, 12 512         conv3d_23[0][0]                  
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 2, 41, 51, 12 8320        activation_13[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 2, 41, 51, 12 0           batch_normalization_15[0][0]     
                                                                 conv3d_24[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 2, 41, 51, 12 0           add_7[0][0]                      
__________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)  (None, 4, 82, 102, 1 0           activation_15[0][0]              
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 4, 82, 102, 6 221248      up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 4, 82, 102, 6 256         conv3d_25[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 4, 82, 102, 6 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 4, 82, 102, 6 110656      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 4, 82, 102, 6 256         conv3d_26[0][0]                  
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 4, 82, 102, 6 8256        up_sampling3d_2[0][0]            
__________________________________________________________________________________________________
add_8 (Add)                     (None, 4, 82, 102, 6 0           batch_normalization_17[0][0]     
                                                                 conv3d_27[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 4, 82, 102, 6 0           add_8[0][0]                      
__________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)  (None, 4, 82, 102, 6 0           activation_17[0][0]              
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 4, 82, 102, 3 55328       up_sampling3d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 4, 82, 102, 3 128         conv3d_28[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 4, 82, 102, 3 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (None, 4, 82, 102, 3 27680       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 4, 82, 102, 3 128         conv3d_29[0][0]                  
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (None, 4, 82, 102, 3 2080        up_sampling3d_3[0][0]            
__________________________________________________________________________________________________
add_9 (Add)                     (None, 4, 82, 102, 3 0           batch_normalization_19[0][0]     
                                                                 conv3d_30[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 4, 82, 102, 3 0           add_9[0][0]                      
__________________________________________________________________________________________________
conv3d_31 (Conv3D)              (None, 4, 82, 102, 3 2595        activation_19[0][0]              
==================================================================================================
Total params: 1,301,091
Trainable params: 1,299,811
Non-trainable params: 1,280
__________________________________________________________________________________________________
None
